<details ><summary>apply for oracle-fundaztic 2025-08-13 15:16:27 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project kokkeanshern/infrastructure#oracle-fundaztic has been locked by PR #11
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # oci_artifacts_container_repository.fundaztic-dev will be created
  + resource "oci_artifacts_container_repository" "fundaztic-dev" {
      + billable_size_in_gbs = (known after apply)
      + compartment_id       = "ocid1.compartment.oc1..aaaaaaaawutq5bmyehb2obqa3hcvstm5gzmboh62p7ixwwhdvgz2r73kvynq"
      + created_by           = (known after apply)
      + defined_tags         = (known after apply)
      + display_name         = "fundaztic/dev"
      + freeform_tags        = (known after apply)
      + id                   = (known after apply)
      + image_count          = (known after apply)
      + is_immutable         = false
      + is_public            = false
      + layer_count          = (known after apply)
      + layers_size_in_bytes = (known after apply)
      + namespace            = (known after apply)
      + state                = (known after apply)
      + system_tags          = (known after apply)
      + time_created         = (known after apply)
      + time_last_pushed     = (known after apply)

      + readme (known after apply)
    }

  # oci_artifacts_container_repository.fundaztic-prod will be created
  + resource "oci_artifacts_container_repository" "fundaztic-prod" {
      + billable_size_in_gbs = (known after apply)
      + compartment_id       = "ocid1.compartment.oc1..aaaaaaaawutq5bmyehb2obqa3hcvstm5gzmboh62p7ixwwhdvgz2r73kvynq"
      + created_by           = (known after apply)
      + defined_tags         = (known after apply)
      + display_name         = "fundaztic/prod"
      + freeform_tags        = (known after apply)
      + id                   = (known after apply)
      + image_count          = (known after apply)
      + is_immutable         = false
      + is_public            = false
      + layer_count          = (known after apply)
      + layers_size_in_bytes = (known after apply)
      + namespace            = (known after apply)
      + state                = (known after apply)
      + system_tags          = (known after apply)
      + time_created         = (known after apply)
      + time_last_pushed     = (known after apply)

      + readme (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
oci_artifacts_container_repository.fundaztic-prod: Creating...
oci_artifacts_container_repository.fundaztic-dev: Creating...
oci_artifacts_container_repository.fundaztic-dev: Creation complete after 1s [id=ocid1.containerrepo.oc1.ap-singapore-1.0.ax1h9bph8nyo.aaaaaaaaxbjjlteflzgqkqka6lckqbg2az2hg52hsbnysoo2y3nyhk4aydtq]
oci_artifacts_container_repository.fundaztic-prod: Creation complete after 1s [id=ocid1.containerrepo.oc1.ap-singapore-1.0.ax1h9bph8nyo.aaaaaaaamonxt4yefekof4yzyykp6towgyusxez564bmns2bwbp5rikv77wa]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```
</details>

</details>